package com.hneu.core.datasource.promo.testing

import com.hneu.core.datasource.promo.RemotePromoDataSource
import com.hneu.core.domain.product.Tag
import com.hneu.core.domain.promo.Promo
import kotlinx.coroutines.flow.Flow
import com.hneu.core.domain.request.Result
import kotlinx.coroutines.flow.flowOf

class FakeRemotePromoDataSource : RemotePromoDataSource {
    override fun getPromos(): Flow<Result<List<Promo>>> {
        return flowOf(Result.Success(FAKE_LIST))
    }

    companion object {
        val FAKE_LIST = listOf(
            Promo(
                id = 0,
                name = "Звернення",
                titleImageSrc = "https://i.imgur.com/ShNJtWa.png",
                detailedDescription = "ЗВЕРНЕННЯ\n" +
                        "ДО ЙОГО БЕЗОСІБНОЇ ЯСНОВЕЛЬМОЖНОСТИ ГЕТЬМАНА КРОПИВАЧУ\n" +
                        "\n" +
                        "Ваша Безосібна Ясновельможносте, Щиро вітаю Вас, як єдино можливого очільника Української Іміджборди у нелегкі для неї часи. Вірю, що у Вашій особі ми віднайдемо того вождя, який поведе Іміджборду і всю Безосібну Націю до подолання усіх загроз та будучого процвітання. Переконано заявляю про свою відданість Безосібній Монархії та належність до Націонал-кропивацької партії. На мою думку, не потребує зайвих арґументів, що для ладу і безпечности Гетьманат потребує певних законів. З метою накопичувати і зберігати закони Монархії гадається мені, що варто Вашій Ясновельможности заснувати Міністерство юстиції. Вважаю себе спроможним обійняти посаду Міністра юстиції. На доказ цього надаю до уваги Вашої Ясновельможности попередні статті, написані мною.\n" +
                        "\n" +
                        "Стаття 1. Оскільки Безосібна Монархія твердо стоїть о якомога повнішому розвої кожної дошки та треду, остільки надає їм самостійности у вирішенні напряму їх будучого поступу. Однак задля безпечности тої цінности, якою є Українська Іміджборда, Монархія конче мусить орґанізовувати лояльних безосібних на боротьбу з ворожими елементами, як-то: московитами, раком та нетематикою. Ради тої цілі Монархія витворює з-поміж щонайбільш ревних прихильників Іміджборди Кропивацьку Варту. Кропивацька Варта єсть єдина сила оборони Іміджборди. За першим покликом Гетьмана кожен свідомий безосібний мусить стати до лав Варти. Головним очільником Кропивацької Варти є Гетьман. Для зґуртування всіх сил Іміджборди у борні з ворогами та щонайширшої помочи Варті орґанізовується Міністерство оборони і наступу на чолі з Міністром. Міністр оборони й наступу є найпершим помічником Гетьмана у справі безпечности Іміджборди.\n" +
                        "\n" +
                        "Стаття 2. Кожен безосібний Української Іміджборди мусить бути свідомий того, що Іміджборда єсть вища форма існування й діяльности Української Безосібної Нації. Для прилучення ньюфаґів до УБК та боротьби з чужинськими ідеями Безосібна Монархія витворює Міністерство пропаґанди на чолі з Міністром. Міністерство аґітує безосібних на Українській Іміджборді, підтримує бойовий дух Кропивацької Варти протягом усіх її акцій.\n" +
                        "\n" +
                        "Стаття 3. Поступ УБК спричиняє невпинну зміну в умах безосібних та зумовлює перелаштування політики Гетьманату. Для повнішого збереження надбань УБК та досвіду будівництва Безосібної Нації витворюється Гетьманська академія Драматика. Академія Драматика являється невід’ємною частю Української Іміджборди. Управителем Академії є Гетьман.\n" +
                        "\n" +
                        "Бажаю Вашій Ясновельможности здоров'я та благополуччя.\n" +
                        "\n" +
                        "Безосібний\n" +
                        "\n" +
                        "P.S. Ви хотіли держави? Ну-ну. Будете й бюрократію мати.",
                tags = listOf(
                    Tag(
                        id = 0,
                        name = "zvernennya"
                    )
                )
            ),
            Promo(
                id = 1,
                name = "ЩО БУЛО ПРИ ХМЕЛЬНИЦЬКОМУ, ЩО МИ ВТРАТИЛИ",
                titleImageSrc = "https://galinfo.com.ua/media/gallery/full/k/h/khmel.jpg",
                detailedDescription = "1. МАЗАНКИ РОБИЛИ З МОЛОЧНОГО ВАПНА, ХОЧ ВІДЛАМУЙ ШМАТОЧОК СТІНИ І ЇЖ\n" +
                        "2. СИЛА ГРАВІТАЦІЇ БУЛА СЛАБША В 4 РАЗИ, КОЗАКИ В КАФУ ЗАСКАКУВАЛИ З РОЗБІГУ ПЕРЕСКОЧИВШИ МОРЕ\n" +
                        "3. ЛЮДИ ЖИЛИ ВІЧНО І ЗАЛУПУ МАЛИ ЯК МАКОГОН, АЛЕ В СЕРЕДНЬОМУ У 80 РОКІВ ХОРОБРО ПОМИРАЛИ В БОЮ\n" +
                        "4. ЯКЩО СПІТКНЕШСЯ НА ВУЛИЦІ, ТО КОЗАКИ ВІДРАЗУ ПІДБІГАЛИ ЛЮЛЬКУ НАБИВАЛИ, ПХАЛИ ЗОЛОТО В КИШЕНІ І БРАТАЛИСЯ\n" +
                        "5. ОЛЕНІ, КАЧКИ, КАБАНИ ТА ПОЛЯКИ САМІ ПІД МАЗАНКУ ПРИБІГАЛИ І ВІДРАЗУ В ПІЧ ЗАСКАКУВАЛИ\n" +
                        "6. РОЗКАЗУВАВ ОРЛИК В КОНСТИТУЦІЇ, ЩО ВСІ ЛЮДИ ВНОЧІ ПРОКИДАЛИСЬ ВІД БАЖАННЯ ГЕРОЇЧНО ЗАГИНУТИ В БОЮ І ВІДРАЗУ НА СІЧ БІГЛИ\n" +
                        "7. ВАГІТНІСТЬ ТРИВАЛА 2 ТИЖНІ, ДІТЕЙ ЗА ОСЕЛЕДЦІ ВИТЯГУВАЛИ, НОВОНАРОДЖЕННІ ВАЖИЛИ ПО 20 КГ І МАЛИ ПРИ СОБІ ШАБЛЮ\n" +
                        "8. ВОДА У ДНІПРІ НА СМАК БУЛА ЯК КВАС І ЛЮДЕЙ ВОСКРЕШАЛА\n" +
                        "9. ЗИМОЮ БУЛО МІНУС 70, АЛЕ ВСІ БОСИМИ НА ПОЛЯКІВ ХОДИЛИ\n" +
                        "10. КАЛИНА РОСЛА У БЕРЕЗНЯКУ РОЗМІРОМ З ЯБЛУКО, ЯБЛУКО РОЗМІРОМ З ГАРБУЗИНУ, ГАРБУЗИНА - З ХАТУ, А В ХАТІ КОЗАКИ СИДІЛИ І ПІСЕНЬ СПІВАЛИ, І ТАКИХ, ЩО ВІД НИХ ЗИМОЮ ВИШНІ РОЗЦВІТАЛИ\n",
                tags = listOf(
                    Tag(
                        id = 1,
                        name = "khmel"
                    )
                )
            )
        )
    }
}